{
  "created": "2022-04-05",
  "title": "SenX",
  "type": "Organisation",
  "logo_url": "https://senx.io/assets/img/senx_header_dark.png",
  "location": {
    "title": "SenX SAS",
    "address": "55, rue Charles Nungesser",
    "postal_code": "29490",
    "city": "Guipavas",
    "country": "FR",
    "phone_contact": "",
    "mail_contact": "contact@senx.io",
    "coordinate_list": [48.44201144215278, -4.414527459584225]
  },
  "subsidiary_location_list": [],
  "website_url": "https://senx.io/",
  "founded_year": 2013,
  "kpi_list": [{
    "year": 2020,
    "staff": "",
    "earnings": "-295 818 EUR",
    "total_assets": "2 016 385 EUR",
    "revenues": "476 678 EUR",
    "source_url": "https://www.verif.com/"
  }, {
    "year": 2019,
    "staff": "",
    "earnings": "265 748 EUR",
    "total_assets": "2 112 440 EUR",
    "revenues": "684 400 EUR",
    "source_url": "https://www.verif.com/"
  },{
    "year": 2018,
    "staff": "",
    "earnings": "-153 526 EUR",
    "total_assets": "1 527 215 EUR",
    "revenues": "687 133 EUR",
    "source_url": "https://www.verif.com/"
  },{
    "year": 2017,
    "staff": "",
    "earnings": "127 356 EUR",
    "total_assets": "1 485 954 EUR",
    "revenues": "745 713 EUR",
    "source_url": "https://www.verif.com/"
  }],
  "solution_list": [{
    "title": "Warp 10",
    "logo_url": "https://www.warp10.io/assets/img/header-w-white.png",
    "website_url": "https://www.warp10.io/content/01_About",
    "created_year": 2013,
    "description": "Warp 10 is one of the most advanced time series platform, ensuring a seamless experience with existing data ecosystems. It addresses challenges posed by the data produced by consumer IoT devices. SenX, the company leading the Warp 10 development, invested heavily in the research and development of a high performance storage engine and an advanced analytics environment, both specifically crafted for time series augmented by location data (Geo Time Series).",
    "category_list": ["Storage and database","IoT and industrial"],
    "similar_solution_list": [{
      "title": "Minitab Statistical Solution",
      "similiar_solution_url": "https://www.minitab.com/en-us/products/minitab/",
      "category": "Storage and database"
    },{
      "title": "Azure Time Series Insights",
      "similar_solution_url": "https://azure.microsoft.com/en-us/services/time-series-insights/#product-overview",
      "category": "Storage and database"
    }],
    "licence_list": ["Apache-2.0 License"],
    "source_code_download": "https://github.com/senx/warp10-platform",
    "source_code_profile": "https://www.openhub.net/p/warp10-platform/analyses/latest/languages_summary",
    "commercial_support_url": "https://www.warp10.io/content/30_Commercial_support",
    "floss_software": true,
    "commercial_support_open_source_version": true,
    "commercial_support_available": true,
    "wikipedia_url": "https://fr.wikipedia.org/wiki/Warp_10",
    "reference_list": [],
    "success_case_list": [{
      "title": "case study",
      "description": "AIM45 proposes a solution to store and analyze data produced by sailboats. This solution is based on Warp 10 and includes algorithms and visualizations designed by experts in yacht races. It is compatible with many types of data loggers, so the produced data can be easily retrieved and analyzed.",
      "image_url": "https://senx.io/assets/img/logos/AIM45-logo.png",
      "industry": "Information Technology",
      "customer": "AIM45",
      "country": "US",
      "language": "en",
      "success_case_url": "https://senx.io/cases-studies/aim45"
    },{
      "title": "case study",
      "description": "Concerned about providing quality service and increasing the lifespan of its heat pumps, AMZAIR wanted to develop a connected heat pump solution to perform remote diagnostics and maintenance and thus avoid unnecessary interventions. Amzair uses Warp 10 to perform weekly consolidated problem analysis on all systems and multi-month analysis of defrost efficiency and compressor runtime. An overview of the heat pump fleet also allows Warp 10 to differentiate an installation or adjustment fault from a design fault.",
      "image_url": "https://senx.io/assets/img/logos/amzair.png",
      "industry": "Manufacturing",
      "customer": "AMZAIR",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/cases-studies/amzair"
    },{
      "title": "case study",
      "description": "As a bancassurance group, Arkea has a large IT infrastructure, and wanted to be able to have a global view of its entire fleet, without multiplying the tools to be put in place.A solution was needed to ingest a very large amount of data. Warp 10 turned out to be the only database that met our needs. Warp 10 is used today within several Arkea departments, especially to monitor the machine park (CPU, RAM, disks, …), including the mainframe. Beyond the IT scope, different departments use Warp 10 with more business-oriented objectives, for example, to know the number of connected users or the number of transactions.",
      "image_url": "https://senx.io/assets/img/logos/arkea.png",
      "industry": "Banking and Finance",
      "customer": "ARKEA",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/cases-studies/arkea"
    },{
      "title": "case study",
      "description": "Centreon is finalizing the creation of a Machine Learning-oriented offering and needed to store customer metrics in order to run its learning models and Machine Learning algorithms used for anomaly detection. To do this, the company collects system and functional metrics, and application logs. All these data are stored in Warp 10. The platform provides unique storage for all time series data, whether digital or in the form of strings and the major advantage is also that WarpScript allows us to perform complex operations for calculating statuses or doing data visualization without adding intermediate components.",
      "image_url": "https://senx.io/assets/img/testimonials/centreon-logo.png",
      "industry": "Information Technology",
      "customer": "CENTREON",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/cases-studies/centreon"
    },{
      "title": "case study",
      "description": "The surgical resuscitation team at the CHRU in Brest wanted to record intracranial pressure and blood pressure at 100Hz, to study the influence of the shape of the curve on the values reached. This recording must be continuous, 24 hours a day, 7 days a week. To avoid any human manipulations, such as manual data exports on a USB key, the CHRU wanted to develop a fully automated datalogger, with data feedback on the Internet as soon as the connection is available.The CHRU uses Warp 10 in its embedded version to ensure local storage and resynchronization of data with the Warp 10 SaaS base.",
      "image_url": "https://senx.io/assets/img/logos/CHRU_Brest.png",
      "industry": "Health and Life Sciences",
      "customer": "CHRU Brest",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/cases-studies/chru"
    },{
      "title": "case study",
      "description": "With a strong  desire to grow in a spirit of automating infrastructure management Clever cloud chose Warp 10 because they needed a database capable of ingesting and processing the large number of measurements made and sent at any time. They also needed a database that could handle high cardinality. Therefore they use different versions of Warp 10: a distributed version with the redundancy of essential components for data storage and analysis, and several «In Memory» versions for quick access to recent data.",
      "image_url": "https://senx.io/assets/img/logos/clevercloud.svg",
      "industry": "Information Technology",
      "customer": "Clever cloud",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/cases-studies/clevercloud"
    },{
      "title": "case study",
      "description": "The company works with data from geographic information systems (GIS), demographic data, but also with sensor data from the IoT. Eegle therefore researched what tools existed to analyze, process and make sensor data intelligible as this type of data cannot be processed with conventional tools. Warp 10 is used on several projects, with different territorial players, including Pride, a project to develop an innovative regional energy data platform. Warp 10 is deployed on virtual machines to collect energy metering data (Linky, Gazpar). The processing functionalities of Warp 10 make it possible to build indicators on the consumption and production of energy at different territorial levels and to follow their evolution over time.",
      "image_url": "https://senx.io/assets/img/logos/eegle.png",
      "industry": "Information Technology",
      "customer": "Eegle",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/cases-studies/eegle"
    },{
      "title": "case study",
      "description": "Energisme collects data in real-time from a multitude of IoT data sources (energy meter, Building Management System / Centralized Technical Management, temperature time series, etc.) and Warp 10 allows direct and rapid use of the algorithms available for the subject of Device Management and predictive maintenance of the fleet.",
      "image_url": "https://senx.io/assets/img/testimonials/energisme.svg",
      "industry": "Information Technology",
      "customer": "Energisme",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/assets/img/testimonials/energisme.svg"
    },{
      "title": "case study",
      "description": "Kalvad works with several customers with data storage and analysis needs. For many, it is monitoring, but the company also has to deal with sporadic data. So Kalvad required a scalable solution that could handle a large volume of data. Currently Warp 10 is used on many of their projects. The platform retrieves data from a call center management solution, which in particular enables emotional analysis of calls received over a long period of time. Also, it allows them to keep data at the perfect time, without any compromises around the data integrity. Warp 10 is also used to store IoT data and for ingesting logs from various formats.",
      "image_url": "https://senx.io/assets/img/testimonials/kalvad.png",
      "industry": "Information Technology",
      "customer": "Kalvad",
      "country": "AE",
      "language": "en",
      "success_case_url": "https://senx.io/cases-studies/kalvad"
    },{
      "title": "case study",
      "description": "S3PWeb often has many information sources that are not synchronized to the same timestamp.The WarpScript language has made it possible to perform preprocessing on the database side, for example to synchronize the GPS positions of various time series in a few lines of code, or even to create redundant information filters.",
      "image_url": "https://senx.io/assets/img/logos/s3p-web.png",
      "industry": "Information Technology",
      "customer": "S3P Web",
      "country": "FR",
      "language": "fr",
      "success_case_url": "https://senx.io/cases-studies/s3pweb"
    }]
  }]
}
