{
	"created": "2022-03-30",
	"title": "Tresorit",
	"type": "Corporation",
	"logo_url": "https://tresorit.com/blog/content/images/2020/12/tresorit-logo-400x400px-2.png",
	"location": {
		"title": "Tresorit AG",
		"address": "Franklinstrasse 27",
		"postal_code": "8050",
		"city": "Zurich",
		"country": "CH",
		"phone_contact": "",
		"mail_contact": "",
		"coordinate_list": [47.409659765790934, 8.543620563704717]
	},
	"subsidiary_location_list": ["HU", "DE"],
	"website_url": "https://tresorit.com/fr",
	"founded_year": "2012",
	"kpi_list": [],
	"solution_list": [{
		"title": "Tresorit",
		"logo_url": "https://tresorit.com/blog/assets/images/header/logo.svg?v=9bb52a92d5",
		"website_url": "https://tresorit.com/",
		"created_year": "2012",
		"description": "Tresorit is an online cloud storage that uses end-to-end encryption to guarantee the safety of all the data you share and store.",
		"category_list": ["Storage and database", "Cybersecurity"],
		"similar_solution_list": [{
			"title": "Nextcloud",
			"similiar_solution_url": "https://nextcloud.com/",
			"category": "Storage and database"
		}, {
			"title": "Dropbox",
			"similiar_solution_url": "https://www.dropbox.com/",
			"category": "Storage and database"
		}, {
			"title": "pCloud",
			"similiar_solution_url": "https://www.pcloud.com/fr/eu?ref=8097",
			"category": "Storage and database"
		}, {
			"title": "Cryptomator",
			"similiar_solution_url": "https://cryptomator.org/",
			"category": "Storage and database"
		}],
		"licence_list": [],
		"source_code_download": "",
		"source_code_profile": "",
		"commercial_support_url": "https://tresorit.com/fr/pricing",
		"floss_software": false,
		"commercial_support_open_source_version": false,
		"commercial_support_available": true,
		"wikipedia_url": "https://en.wikipedia.org/wiki/Tresorit",
		"reference_list": [{
			"title": "Deutsche Telekom IT Solutions",
			"logo_url": "https://cdn.tresorit.com/webv10/dist/gatsby/static/43382d3e1fc299a39257fd1c36dd5d03/dc167/deutsche-telekom.webp",
			"country": "DE",
			"industry": "Telecommunication"
		}, {
			"title": "Marks and Clerk",
			"logo_url": "https://www.marks-clerk.com/media/lrtlzzjs/marks-clerk-logo-white.svg",
			"country": "GB",
			"industry": "Consulting and Training"
		}, {
			"title": "Deutsches Rotes Kreuz",
			"logo_url": "https://cdn.tresorit.com/webv10/dist/gatsby/static/ef8d3add64363d99ef31f9bcd46a7f91/german-red-cross.svg",
			"country": "DE",
			"industry": "Association and NGOs"
		}, {
			"title": "D-Orbit",
			"logo_url": "https://static.wixstatic.com/media/64a0e4_fb570b3572674acbb304f06d2918b058~mv2_d_1775_1204_s_2.png/v1/crop/x_10,y_0,w_1765,h_1121/fill/w_170,h_108,al_c,usm_0.66_1.00_0.01,enc_auto/Negativo-RGB-transparent.png",
			"country": "IT",
			"industry": "Aviation and Aerospace"
		}, {
			"title": "Public International Law & Policy Group",
			"logo_url": "https://images.squarespace-cdn.com/content/v1/5900b58e1b631bffa367167e/1564063874712-S62R7II9Q26QJTZLVJSB/2018-08-17.jpg?format=1500w",
			"country": "US",
			"industry": "Consulting and Training"
		}, {
			"title": "Icon Films",
			"logo_url": "https://iconfilms.co.uk/wp-content/uploads/2021/11/social.png",
			"country": "GB",
			"industry": "Media and Entertainment"
		}, {
			"title": "Riot Studios",
			"logo_url": "https://cdn.tresorit.com/webv10/dist/gatsby/static/dec2562f5501b955a15ff5759dd3ba53/riot-studios.svg",
			"country": "US",
			"industry": "Media and Entertainment"
		}],
		"success_case_list": [{
			"title": "Enabling secure collaboration: how Tresorit helped Viessmann regain control of their processes",
			"description": "As a company well versed with the requirements of digital transformation, Viessmann had already made significant changes to its ways of working in recent years. Browser based applications were commonplace throughout the company, and a migration to Google Workspace 5 years prior to Tresorit’s involvement had driven considerable efficiencies. The next step in Viessmann’s transformation was adding an additional layer of security to departments like R&D and Procurement, who had previously edited and shared documents containing confidential information – like CAD models, patent data and functional specifications – using conventional (and, by definition, unsecure) methods.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/viessmann/viessmann-logo.06a46841.svg",
			"industry": "Manufacturing",
			"customer": "Viessmann",
			"country": "DE",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-data-exchange-viessmann"		
		}, {
			"title": "Removing the barriers to creative workflows thanks to Tresorit's secure collaboration tool",
			"description": "Having strengthened their position within Central and Eastern Europe, digitalisation was the next strategic decision left for Erste Bank to push through in order to futureproof their organisation and maintain their market share. Rethinking their approach to creative asset management occupied a prominent place on Erste Bank’s transformational agenda. The challenges they faced were symptomatic of any large organisation collaborating with external partners – insecure channels for collaboration and inefficient processes/tools governing these.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/gatsby/static/d0432b796fe4df3ed0566aee38efba90/erste-bank.svg",
			"industry": "Banking and Finance",
			"customer": "Erste Bank",
			"country": "AT",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/erste-bank-external-collaboration"		
		},{
			"title": "Enabling cloud integration: how Tresorit helped to digitize KB Flughafen’s workforce",
			"description": "Airports handle huge amounts of personal data from passengers, airlines, suppliers and cargo shippers every single day. This makes data security a huge concern to keep information (around operations, transactions and passengers) secure.to keep information (around operations, transactions and passengers) secure.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/gatsby/static/61601453732c349963f73eda99f9f758/dc167/flughafen.webp",
			"industry": "Transport",
			"customer": "Köln Bonn Flughafen",
			"country": "DE",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/data-security-koln-bonn-airport"
		},{
			"title": "HR, uninterrupted: a start-up’s journey to success and safety",
			"description": "A French payroll and HR management SaaS with clients all over EUrope, PayFit needed a maximum secured way to collect, save and manage the sensitive data of their customers while being able to work from anywhere. Tresorit and-to-end encryption, as well as its secured file sharing on its own cloud proved to be the most efficient solution for the Fintech company and their over 3000 customers.",
			"image_url": "https://www.datocms-assets.com/50397/1640774984-payfitlogo.svg",
			"industry": "Banking and Finance",
			"customer": "PayFit",
			"country": "FR",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-data-management-for-payfit"
		}, {
			"title": "Security services streamlined thanks to Tresorit's fully compliant collaboration tool",
			"description": "The Hungarian High Tech Security Services needed a solution to ensure the secure storage and sharing of highly confidential data for their numerous clients that respond to critical incidents and crisis. Therefore, Tresorit appeared to be the most satisfying provider for White Hat IT Security thanks to its encrypted storage and file sharing with multi-factor authentication for highly sensitive data, TISAX and GDPR compliant.",
			"image_url": "https://whitehat.eu/wp-content/uploads/2021/10/wh_IT_long.png",
			"industry": "Cybersecurity",
			"customer": "White Hat IT Security",
			"country": "HU",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/encrypted-cloud-collaboration-white-hat"
		}, {
			"title": "100 years of women working for peace and equality",
			"description": "In 1932, long before the age of internet and social media activism, members of WILPF collected 6 million signatures for peace and delivered their petition to the World Disarmament Conference in Geneva. Not only did they demonstrate that people desperately wanted peace, they publicly showed the connection between wars and the arms industry for the first time. In 2016, one of WILPF’s focus areas is turning the international attention to human rights violations in conflict zones. WILPF has been cooperating with local activists who face threats every day, reporting crimes committed against people and showing the impact of the war on women.",
			"image_url": "https://i0.wp.com/www.wilpf.org/wp-content/uploads/2021/06/WILPF_Logo_Long_1.png?resize=2048%2C761&ssl=1",
			"industry": "Association and NGOs",
			"customer": "WILPF - Women's International League for Peace and Freedom",
			"country": "CH",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/wilpf"
		}, {
			"title": "A safe distance: sharing uber-valuable intelligence across borders and in the cloud",
			"description": "For Paddy Beiner, managing director of Bearstone Global’s Berlin office and partner in the holding company’s head office in Warsaw, risk is not just part of the game. It’s the name of the game. The business intelligence and investigations company helps clients identify risk related issues in all aspects of their operations: clients and supplier relationships, financial dealings, investments and court proceedings, to name but a few. “We primarilly focus on Western, Central and Eastern Europe but we’re operating globally, including in the Middle East, Africa and Southeast Asia. Pretty much wherever our clients need us,” Paddy sums up. The company is headquartered in Warsaw but also has subsidiaries in Berlin and London with full-time staff, plus an extensive partner network across the globe",
			"image_url": "https://cdn.tresorit.com/webv10/dist/gatsby/static/488c4347d1f65aa59ea7126bc3c545d9/dc167/bearstone-global.webp",
			"industry": "Consulting and Training",
			"customer": "Bearstone Capital",
			"country": "DE",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-cloud-storage-for-bearstone-global"
		}, {
			"title": "Reliability and security: It doesn’t have to be an either-or choice when going serverless",
			"description": "Can you run a business without a server? When Dr Christoph Plapp, owner and managing partner of Logivations, a consulting and technology company for supply chain, logistics and e-commerce, decided to cut the cord and move all business documents to the cloud, it seemed like a no-brainer. With sales and consulting teams, as well as partners and clients all over Europe and beyond, using a secure Virtual Private Network (VPN) connection just didn’t seem to do the job anymore.",
			"image_url": "https://www.logivations.com/img_general/new-images/logivations_logo.svg",
			"industry": "Consulting and Training",
			"customer": "Logivation",
			"country": "DE",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/benefits-of-moving-to-the-cloud"
		}, {
			"title": "A matter of life and death: the importance of secure data sharing in healthcare",
			"description": "",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/crib/crib-logo.04da6206.svg",
			"industry": "Health and Life Sciences",
			"customer": "Cardiovascular Research Institute Basel",
			"country": "CH",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-file-and-data-sharing-in-healthcare"
		}, {
			"title": "Rural, human, digital: farmers get current information remotely thanks to Tresorit",
			"description": "",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/raiffeisen-mitte/logo.70ddf5d7.jpg",
			"industry": "Agriculture and Food",
			"customer": "Niedersachsen Mitte eG ",
			"country": "DE",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-file-sharing-for-raiffeisen-mitte"
		},{
			"title": "Security, word for word: safe and easy collaboration between consultant interpreters and clients",
			"description": "Calliope-Interpreters is a global network of interpretation service providers. Calliope-Interpreters delivers turnkey simultaneous interpretation services for meetings and events across the globe and does so in accordance with the highest international standards. During their missions clients have to share important sometimes classified files and the challenge for them was  serving clients across borders with security concerns  of confidential conference material. They tried few solutions such as Microsoft's SharePoint but it was complicated and too pricey. When they came across Tresorit, which seemed like a good, easy-to-use and secure solution for them according to Christoph Renfer, President of Calliope-Interpreters they test ran it for a year and found it  best suited for their business because of Tresorit's zero-knowledge, end-to-end encrypted file storage and secure share links which ensure quick and safe file sharing across collaborators",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/calliope-interpreters/logo.f56bbef4.png",
			"industry": "Consulting",
			"customer": "Calliope-interpreters",
			"country": "CH",
			"language": "fr",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-collaboration-for-calliope-interpreters"
		},{
			"title": "Saving lives with cloud security",
			"description": "The Jiyan Foundation supports survivors of human rights violations and defends fundamental freedoms in Iraq, Kurdistan-Iraq, and Syria. In their daily basis activities they need to protect data about survivors of human rights violations. Its security can literally mean the difference between life and death. So, the Jiyan team tried moving into the cloud and they set up a Dropbox account. They were briefly happy with the fast file storage and sharing it provided. But then Edward Snowden's revelations forced them to abandon Dropbox, feeling it insecure for the highly delicate data they work with. In searching for a new alternative they found Tresorit with its end-to-end encrypted cloud storage. Now the team is even more productive with Tresorit than Dropbox, and files are accessed and edited remotely without putting data at risk.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/company/case-studies/logo/jiyan.5f237562.svg",
			"industry": "Associations and NGOs",
			"customer": "Jiyan Foundation",
			"country": "DE",
			"language": "DE",
			"success_case_url": "https://tresorit.com/resources/customer-stories/cloud-security-for-ngos"
		},{
			"title": "Implementing Tresorit’s secure cloud storage system for storing patient records",
			"description": "Wings of Hope changes and saves lives through the power of aviation. In the U.S., the nonprofit provides free medical air transport services to individuals who need access to specialized medical care. Running a medical transport system means that the organization has to go over sensitive medical records and comply with strict regulations when storing and sharing such data. For years, the charity had been using a paper- and faxed-based system, which wasn’t totally foolproof so it was time to look for a better solution that enables remote, secure storage of their patients’ confidential information. Tresorit’s secure cloud solution provided Wings of Hope with the secure place the charity needed to store and archive protected health information. Sharing information among its medical staff who are authorized to access a patient’s medical records has become easier and safer too, as an extra layer of protection can be added by setting up a password and an expiry date for documents, and restricting the number of downloads possible. Tresorit’s zero-knowledge end-to-end encryption also means that all data is automatically encrypted before it leaves a device. In other words, it cannot be accessed by anyone, including system administrators and the service provider itself.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/wings-of-hope/wings-of-hope-logo.64d1be21.png",
			"industry": "Associations and NGOs",
			"customer": "Wings of Hope",
			"country": "US",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/cloud-storage-with-hipaa-compliance"
		},{
			"title": "GDPR compliant yet user friendly data management with Tresorit",
			"description": "Intergroup Partners is an international services firm, with expertise in Energy, Healthcare, Mobility, IoT & Industry, and Security, that enables companies to grow through innovation. How to switch to GDPR compliant data management in the cloud had dominated many of the C-level conversations at Intergroup Partners. The consulting firm wanted to find a solution that would reassure clients that their documents were managed according to the requirements of the GDPR and avoid employee mistakes that could result in accidental data breaches. They decided to use Tresorit.  One of the main reason why Intergroup Partners decided to go with Tresorit was that it facilitates GDPR compliance and can help avoid potential hefty fines under the new law.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/company/case-studies/logo/intergroup.51188649.svg",
			"industry": "Consulting and Training",
			"customer": "Intergroup",
			"country": "CH",
			"language": "FR",
			"success_case_url": "https://tresorit.com/resources/customer-stories/the-easy-way-toward-gdpr-compliance"
		},{
			"title": "A secure and convenient alternative to hard drives",
			"description": "Riot Studios is an award-winning film production company located in Austin. The idea of choosing a solution for storing and encrypting data came out from a unfortunate situation where Will filmmaker got its equipment and footage for a documentary stolen. He looked into a broad range of solutions and found Tesorit. Unlike mainstream providers like Dropbox, Tresorit uses a zero-knowledge, end-to-end encryption system enabling only Will and his team to access their files. Tresorit doesn’t even store passwords on its servers, meaning that even if the system was breached, there’s no way a hacker could decrypt the files. Apart from providing top level security, Tresorit also offers flexibility for Riot Studios by allowing access to footage and data safely from anywhere, even on smartphones",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/company/case-studies/logo/riot-logo.de7afcdf.svg",
			"industry": "Media and Entertainment",
			"customer": "Riot studios",
			"country": "US",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/cloud-backup-external-hard-drive"
		},{
			"title": "Driving confidentiality: Tresorit to provide the highest level of security to automotive clients",
			"description": "Forge Design is a global marketplace for the best automotive design talent, offering world-class design services with distributed teams and exceptional project management. Tapping a network of over 200 seasoned designers, the company provides access to great ideas and simple workflow management tools in a secure and flexible way. Forge decided to look for a secure file-storing and sharing solution that puts their clients’ minds at ease. After two months of research and trials, they set their heart on Tresorit. His entire team uses Tresorit in their day-to-day to create and manage folders, upload and download sensitive files and create secure links to share them. They first set up tresors to store and share files for projects only. However, they quickly started sending files above a certain size via tresors for simplicity; and now use Tresorit Drive to store even their day-to-day company files, enabling their employees to work in a fully distributed way.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/forge-design/logo.da3d9fa2.png",
			"industry": "Automotive",
			"customer": "Forge Design",
			"country": "UK",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/highest-level-of-security-for-automotive-clients"
		},{
			"title": "Building business with cloud security",
			"description": "Apogee wanted their attorneys to have instant, secure and hassle-free access to documents, wherever they traveled. They have decided to move to the cloud to cut internal IT costs, decrease hardware expenses, and increase productivity. Gregory, Apogee founder was set to go with Dropbox, but discussions with the Apogee partners raised the issue that some current and potential clients have concerns about Dropbox. After many researches Tresorit turned out to be the appropriate solution. Apogee wanted their attorneys to have instant, secure and hassle-free access to documents, wherever they traveled. They have decided to move to the cloud to cut internal IT costs, decrease hardware expenses, and increase productivity. Gregory, Apogee founder was set to go with Dropbox, but discussions with the Apogee partners raised the issue that some current and potential clients have concerns about Dropbox. After many researches Tresorit turned out to be the appropriate solution. It's easy and provide secure access anywhere with no bandwidth limitations.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/company/case-studies/logo/logo-apogee.ea148317.png",
			"industry": "Consulting and Training",
			"customer": "Apogee",
			"country": "US",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-cloud-storage-for-law-firms"
		},{
			"title": "A matter of life and death: the importance of secure data sharing in healthcare",
			"description": "The Cardiovascular Research Institute Basel (CRIB) is part of the University Hospital of Basel’s Department of Cardiology. Its main focus is clinical research on acute cardiac conditions and improvements of established processes in many fields of clinical medicine.  The research centre needed a system that was easy to use and easy to implement for people of varying technical ability, and was available anytime, anywhere for transferring and managing files. Tresorit was the right solution for them. According to Dr. Tobias Zimmermann compared to other services like Dropbox, Tresorit’s solution is much safer, compared to manual encryption, it’s less hassle, and compared to other online services, it offers a much better overall package.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/crib/crib-logo.04da6206.svg",
			"industry": "Health and Life Sciences",
			"customer": "Cardiovascular Research Institute Basel",
			"country": "CH",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-file-and-data-sharing-in-healthcare"
		},{
			"title": "Tresors on a mission: Using the cloud to combat the HIV epidemic",
			"description": "Founded in 2016, One Tent Health offers fast and free HIV screening to hundreds of Washingtonians in high-risk areas, around grocery stores, convenience stores, laundromats, and community centres. They use Tresorit to  have access to a secure cloud storage with the opportunity to smoothly collaborate with external partners. The solution allows frictionless operation due to fast and safe data sharing and management.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/one-tent-health/one-tent-health-logo.66f23898.png",
			"industry": "Associations and NGOs",
			"customer": "One Tent Health",
			"country": "US",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/hipaa-compliant-data-transfer"
		},{
			"title": "Trusted network: business and proprietary data in the best hands possible",
			"description": "America's Choice Provider Network (ACPN) is a national health care savings provider network based in Henderson. Information about business partners, contracts and the mass of proprietary data the company has accumulated over the years needed to be stored somewhere. And as their team grew, team members also needed a way to access these documents quickly, and without any technical or privacy concerns. They used Dropbox at first but it seemed basic so they switched to Tresorit because of its all-round solution for storing and safeguarding files in the cloud",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/acpn-usa/logo.48eb44f5.png",
			"industry": "Health and Life Sciences",
			"customer": "ACPN",
			"country": "US",
			"language": "en",
			"success_case_url": "https://tresorit.com/resources/customer-stories/easy-to-use-file-storage-for-acpn-usa"
		},{
			"title": "Faster, safer and easier: Defending intellectual property rights the right way with Tresorit",
			"description": "Deshoulières Avocats, a Paris-based law firm specializing in intellectual property and new technologies. The Paris-based law firm could ill afford a data breach and the reputational hit that comes with it. And, the cloud solution the company had been using was just not up to the mark. The time came to look for something new and Etienne certainly did his homework. He scoured the internet, read up on various cloud service providers and weighed up the pros and cons. In the end, he settled on Tresorit. The firm now safeguards its highly confidential and valuable data by adding the extra layers of security Tresorit offers",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/deshoulieres-avocats/da-logo.527b3a88.png",
			"industry": "Consulting and Training",
			"customer": "Deshoulières Avocats",
			"country": "FR",
			"language": "FR",
			"success_case_url": "https://tresorit.com/resources/customer-stories/document-sharing-for-law-firms"
		},{
			"title": "Law and order: detectives protect and serve citizens using Tresorit’s cloud solution",
			"description": "The second-largest sheriff’s office in the Commonwealth of Kentucky, the Boone County Sheriff’s Office employs 174 sworn deputies serving in the Patrol Division and Traffic Unit, Criminal Investigations, Court Services or as School Resource Officers. The far bigger issue they encountered was, of course, the safety of the highly sensitive information they needed to share. In the past, they put what they couldn’t email on a CD or DVD, which of course wasn’t the most secure way to send information.That's when they found Tresorit. The zero-knowledge, end-to-end encryption feature has proven to be of tremendous help to them, especially when giving out case reports.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/company/case-studies/logo/boone-county-sheriff-logo.fd4556e4.png",
			"industry": "Public Administration and Government",
			"customer": "Boone County Sheriff’s Office",
			"country": "US",
			"language": "EN",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-cloud-storage-and-collaboration"
		},{
			"title": "Rural, human, digital: farmers get current information remotely thanks to Tresorit",
			"description": "Raiffeisen-Warengenossenschaft Niedersachsen Mitte eG (Raiffeisen Mitte) serves agriculture with manufacturing equipment, sells farmers products and offers extensive service and advisory. After successful mergers with other cooperatives, storage capacity expansion and entering the renewable energy space, this company’s growth is unstoppable. To keep up with all the changes and to be able to react to digital challenges, they needed a secure cloud tool for storing, syncing and sharing information. Sales Managers needed a cloud solution to be able to access up-to-date information during fieldwork. Employees were using different solutions which led to an unsecure, uncontrolled way of working. With Tresorit, Sales Manager can access their files anytime, anywhere, even on the go. The company has a structured way of working for each department and project. Collaboration on tresors and files with marking them for editing, which helps to avoid editing conflicts and version trees. Customer-focused, fast and professional customer service delivering efficient solutions.",
			"image_url": "https://cdn.tresorit.com/webv10/dist/img/landings/customer-stories/raiffeisen-mitte/logo.70ddf5d7.jpg",
			"industry": "Agriculture and Food",
			"customer": "Raiffeisen-Warengenossenschaft Niedersachsen Mitte eG",
			"country": "DE",
			"language": "DE",
			"success_case_url": "https://tresorit.com/resources/customer-stories/secure-file-sharing-for-raiffeisen-mitte"
		}]
	}]
}
